app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes"
---
  def index
    @likes = Like.all

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_like
      @like = Like.find(params[:id])