app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at Desc

  def create
    @tweet = Tweet.new(tweet_params)
      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "awd"], ["user_id", 3], ["created_at", "2019-02-13 09:31:49.557711"], ["updated_at", "2019-02-13 09:31:49.557711"]]