app/controllers/users_controller.rb

  def index
    @search = params[:firstname]
    @users = User.where("firstname ILIKE ?", @search)
    @user = User.all
---
SELECT "users".* FROM "users" WHERE (firstname ILIKE 'daniel')
SELECT "users".* FROM "users" WHERE (firstname ILIKE 'awd')

  def find
    @user = User.find_by_email params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Daniel@gmail.com"], ["LIMIT", 1]]

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-02-11 02:20:03.995117"], ["updated_at", "2019-02-11 02:20:03.995117"]]